Repository: oxygenxml/blog
Catalog: translations/xliff/2nd translation/translated/oxygen_xml_blog_ro.ditamap.tmx
Source language: en
Languages: ro

source: The Oxygen AI Positron Add-on includes a variety of helpful AI actions designed to boost productivity. However, DITA XML projects have specific requirements. They often need particular terminology and adherence to style guide rules , or they may rely on company-specific DITA specialization DTDs/schemas that differ from the standard DITA DTDs that the AI models are trained on. Therefore, to generate high-quality content using the AI actions, the add-on must be configured to understand the unique aspects of the DITA XML project it will be used with.
ro: Oxygen AI Positron Add-on include o varietate de acțiuni AI utile concepute pentru a crește productivitatea. Totuși, proiectele DITA XML au cerințe specifice. Acestea necesită adesea terminologie particulară și respectarea regulilor din ghidul de stil sau pot depinde de DITA DTD-uri/scheme de specializare specifice companiei, care diferă de DTD-urile DITA standard pe care sunt antrenate modelele AI. Prin urmare, pentru a genera conținut de calitate folosind acțiunile AI, suplimentul trebuie configurat astfel încât să înțeleagă particularitățile proiectului DITA XML cu care va fi utilizat.

source: AI Tools Pros/Cons
ro: Avantaje/Dezavantaje ale instrumentelor AI

source: With their ability to rewrite , research , and generate documentation drafts AI models can be useful in a variety of cases as long as aspects specific to the current DITA XML project can be controlled and enforced.
ro: Datorită capacității lor de a rescrie , de a cerceta și de a genera schițe de documentație , modelele AI pot fi utile în diverse situații, atâta timp cât pot fi controlate și impuse aspectele specifice proiectului DITA XML curent.

source: Good
ro: Bine

source: Bad/Ugly
ro: Rău/Urat

source: Re-write content (correct grammar, active voice, style, readability improvements).
ro: Rescrierea conținutului (corectarea gramaticii, voce activă, îmbunătățirea stilului și a lizibilității).

source: The company specific style guide might impose certain rules that, by default, are not taken into account by the AI model.
ro: Ghidul de stil specific companiei poate impune anumite reguli care, implicit, nu sunt luate în considerare de modelul AI.

source: Generating draft content by combining multiple sources (including images, attached PDF , Word or Markdown documents).
ro: Generarea de conținut de tip schiță prin combinarea mai multor surse (inclusiv imagini, PDF atașat, documente Word sau Markdown ).

source: Hallucinations when generating content if not enough quality context information is provided. The overall terminology or style guide is not taken into account. The DITA XML specializations are also not taken into account by default.
ro: Pot apărea „halucinații” la generarea conținutului dacă nu este furnizată suficientă informație contextuală de calitate. Terminologia generală sau ghidul de stil nu sunt luate în considerare. Specializările DITA XML nu sunt nici ele luate în considerare implicit.

source: Research / Explain concepts (chat).
ro: Cercetare / Explicare concepte (chat).

source: By default an AI model responds to questions based on its training and not on the content from the current user’s manual.
ro: Implicit, un model AI răspunde la întrebări pe baza antrenamentului său și nu pe baza conținutului din manualul de utilizare curent.

source: Access Content From Your Project
ro: Acces la conținutul din proiectul dumneavoastră

source: By default, when researching or asking the AI questions, Retrieval Augmented Generation (RAG) tools give the AI access to search for specific keywords in your current DITA XML documentation and thus provide the AI access to the content of topics which are related and relevant to your discussion.
ro: Implicit, când cercetați sau adresați întrebări AI-ului, instrumentele Retrieval Augmented Generation (RAG) oferă AI-ului acces la căutarea unor cuvinte cheie specifice în documentația DITA XML curentă și astfel permit AI-ului accesul la conținutul topicurilor relevante pentru discuția dumneavoastră.

source: Bundled AI actions like Generate Documentation Draft , Expand Draft , Create Topics give the AI model access to the current indexed DITA XML project to retrieve the topics with content similar to the new content that needs to be created.
ro: Acțiunile AI incluse, precum Generate Documentation Draft , Expand Draft , Create Topics , oferă modelului AI acces la proiectul DITA XML indexat curent pentru a regăsi topicurile cu conținut similar cu cel nou ce trebuie creat.

source: You can create your own custom AI actions that allow RAG access to the current project contents for the AI engine. An example can be found here .
ro: Puteți crea propriile acțiuni AI personalizate care permit motorului AI acces RAG la conținutul proiectului curent. Un exemplu poate fi găsit aici .

source: Overall Project Context and Audience
ro: Contextul general al proiectului și publicul țintă

source: In the Oxygen Preferences AI Positron Assistant preferences page you can set in the Context prompt text area general information about the current project and the intended audience. This context information will be used subsequently for all AI actions and chat sessions.
ro: În pagina de preferințe Preferences AI Positron Assistant din Oxygen, puteți seta în zona de text Context prompt informații generale despre proiectul curent și publicul țintă. Aceste informații de context vor fi folosite ulterior pentru toate acțiunile AI și sesiunile de chat.

source: Example of a context which establishes an overall project scope and audience:
ro: Exemplu de context care stabilește scopul general al proiectului și publicul țintă:

source: # Project context The current project contains technical documentation for a fun and easy to drive dune vehicle named the Sharkfin Rover. # Audience Technical documentation must be precise and easy to understand. Our clients are not technical, they are usually beginners when it comes to driving and their understanding of English may vary.
ro: # Contextul proiectului Proiectul curent conține documentație tehnică pentru un vehicul de tip dune buggy, distractiv și ușor de condus, numit Sharkfin Rover. # Public țintă Documentația tehnică trebuie să fie precisă și ușor de înțeles. Clienții noștri nu sunt tehnici, de obicei sunt începători în condus, iar nivelul lor de înțelegere a limbii engleze poate varia.

source: The same context information should be expanded to include terminology and style guide information for the current project. An example can be found here .
ro: Aceleași informații de context ar trebui extinse pentru a include terminologia și informațiile din ghidul de stil pentru proiectul curent. Un exemplu poate fi găsit aici .

source: Terminology Rules
ro: Reguli de terminologie

source: A DITA XML project may define (in various formats) allowed terms and certain synonyms that are not recommended to be used instead of the allowed terminology.
ro: Un proiect DITA XML poate defini (în diverse formate) termeni acceptați și anumiți sinonimi care nu sunt recomandați a fi folosiți în locul terminologiei permise.

source: The Context prompt text area in the AI Positron Assistant preferences page can also contain rules for the most important terms and disallowed synonyms.
ro: Zona de text Context prompt din pagina de preferințe AI Positron Assistant poate conține și reguli pentru cei mai importanți termeni și sinonimele interzise.

source: Example of context that establishes some of the most important terms:
ro: Exemplu de context care stabilește unii dintre cei mai importanți termeni:

source: # Terminology Specific terms in the DITA XML content must be wrapped in the <term> element. Preserve all such terms and do not attempt to replace them with possible synonyms. Always prefer to use the terms below instead of possible synonyms: ``` Sharkfin Rover (instead of 'Sharkfin Buggy') vehicle (instead of 'car') lorry (instead of 'truck') rear position lamp (instead of 'tailgate') powertrain (instead of 'drivetrain') petrol engine (instead of 'Otto engine') motorcycle (instead of 'motor-bike') engine (instead of 'motor') electronic stability control (instead of 'ESP') motor vehicle chassis (instead of 'vehicle frame') ```
ro: # Terminologie Termenii specifici din conținutul DITA XML trebuie marcați cu elementul <term>. Păstrați toți acești termeni și nu încercați să îi înlocuiți cu posibili sinonimi. Se va prefera întotdeauna utilizarea termenilor de mai jos în locul posibilelor sinonime: ``` Sharkfin Rover (în loc de 'Sharkfin Buggy') vehicle (în loc de 'car') lorry (în loc de 'truck') rear position lamp (în loc de 'tailgate') powertrain (în loc de 'drivetrain') petrol engine (în loc de 'Otto engine') motorcycle (în loc de 'motor-bike') engine (în loc de 'motor') electronic stability control (în loc de 'ESP') motor vehicle chassis (în loc de 'vehicle frame') ```

source: Once the AI model receives the imposed terminology rules as part of the prompt context, it will take them into account for all interactions (e.g. for creating documentation drafts from content that was written without taking the terminology into account).
ro: Odată ce modelul AI primește regulile de terminologie impuse ca parte a contextului prompt, le va lua în considerare pentru toate interacțiunile (de exemplu, pentru crearea de schițe de documentație din conținut scris fără respectarea terminologiei).

source: The Oxygen Terminology Checker add-on can be configured with a terminology rules file that allows it to highlight terminology problems in real time and propose replacement for them. You can find a sample terminology rules file here . There is also a sample AI action that can generate an XML rules file from the add-on based on a style guide.
ro: Suplimentul Terminology Checker din Oxygen poate fi configurat cu un fișier de reguli de terminologie care permite evidențierea în timp real a problemelor de terminologie și propunerea de înlocuiri pentru acestea. Un exemplu de fișier de reguli de terminologie poate fi găsit aici . Există și o acțiune AI exemplu care poate genera un fișier de reguli XML din supliment, pe baza unui ghid de stil.

source: Once the Terminology Checker add-on is installed and flags the terminology problems in the Author visual editor mode, you can use the Fix Terminology Problems AI action to fix terminology problems in the currently opened topic's contents.
ro: Odată ce suplimentul Terminology Checker este instalat și semnalează problemele de terminologie în modul vizual Author , puteți folosi acțiunea AI Fix Terminology Problems pentru a corecta problemele de terminologie din conținutul topicului deschis.

source: As a conclusion, you can add your most important terminology rules in the Context setting to create and process DITA XML content while directly obeying the rules. However, installing the terminology checker add-on allows you to see terminology problems highlighted in the visual editor and to fix them using the AI engine with the bundled Fix Terminology Problems AI action.
ro: În concluzie, puteți adăuga cele mai importante reguli de terminologie în setarea Context pentru a crea și procesa conținut DITA XML respectând direct regulile. Totuși, instalarea suplimentului terminology checker vă permite să vedeți problemele de terminologie evidențiate în editorul vizual și să le corectați folosind motorul AI cu acțiunea AI inclusă Fix Terminology Problems .

source: Style Guide
ro: Ghid de stil

source: A style guide is a set of project-specific standards and guidelines used to ensure consistency and clarity in technical documentation. A company's style guide may come in various formats (DITA XML, Markdown, Word, etc.) but some of the most important rules in the style guide can be distilled and set in the Context prompt text area within the AI Positron Assistant preferences page.
ro: Un ghid de stil este un set de standarde și recomandări specifice proiectului, folosite pentru a asigura coerența și claritatea documentației tehnice. Ghidul de stil al unei companii poate fi în diverse formate (DITA XML, Markdown, Word etc.), dar unele dintre cele mai importante reguli pot fi sintetizate și setate în zona de text Context prompt din pagina de preferințe AI Positron Assistant .

source: Example of context that establishes some of the most important style guide rules:
ro: Exemplu de context care stabilește unele dintre cele mai importante reguli din ghidul de stil:

source: # Style guide There is a set of company specific Style Guide rules which are important to follow when rewriting or creating new content, the most important rules are mentioned below: - Never use a metaphor, simile, or other figure of speech. - Never use a long word where a short one will do. - Keep sentences short. If it is possible to cut a word out, always cut it out. - Never use the passive where you can use the active. - Never use a foreign phrase, a scientific word, or a jargon word if you can think of an everyday English equivalent. - Don’t use text that points to other topics such as "In the document below" or "in the following section." - Some words or phrases are disallowed to be used. Mapping of disallowed phrases to their valid equivalent constructs: ``` as well as, in addition to => and at this time, at this/that point in time => currently, now/then advance planning => planning by means of => by by reason of => because of due to the fact => because during the course of => during end result => result ```
ro: # Ghid de stil Există un set de reguli din Ghidul de Stil al companiei care sunt importante de urmat la rescrierea sau crearea de conținut nou, cele mai importante reguli sunt menționate mai jos: - Nu folosiți niciodată metafore, comparații sau alte figuri de stil. - Nu folosiți niciodată un cuvânt lung acolo unde este suficient unul scurt. - Păstrați propozițiile scurte. Dacă este posibil să eliminați un cuvânt, eliminați-l întotdeauna. - Nu folosiți niciodată diateza pasivă acolo unde puteți folosi diateza activă. - Nu folosiți niciodată expresii străine, termeni științifici sau jargon dacă puteți găsi un echivalent uzual în limba engleză. - Nu folosiți texte care fac trimitere la alte topicuri, cum ar fi „În documentul de mai jos” sau „în secțiunea următoare”. - Unele cuvinte sau expresii sunt interzise. Maparea expresiilor interzise la variantele lor valide: ``` as well as, in addition to => and at this time, at this/that point in time => currently, now/then advance planning => planning by means of => by by reason of => because of due to the fact => because during the course of => during end result => result ```

source: The Oxygen Terminology Checker add-on can also match disallowed words and phrases in the terminology rules file, allowing you to see in the visual editor the style guide problems and to correct them using the bundled Fix Terminology Problems AI action.
ro: Suplimentul Terminology Checker din Oxygen poate identifica și cuvinte sau expresii interzise din fișierul de reguli de terminologie, permițându-vă să vedeți în editorul vizual problemele de stil și să le corectați folosind acțiunea AI inclusă Fix Terminology Problems .

source: Style Guide rules may also impose structural aspects for the DITA XML content and such rules can be automated by converting them to Schematron rules . Once such Schematron rules are added to the DITA XML project and start showing errors in the edited content, the bundled Fix Validation Problems AI action can be used to ask the AI to fix the reported problems in the current document. If the AI engine attempts to save content to a topic and the saved content has validation problems, the AI receives the validation problems and attempts to auto fix the problems until the topic becomes valid.
ro: Regulile din Ghidul de stil pot impune și aspecte structurale pentru conținutul DITA XML, iar astfel de reguli pot fi automatizate prin conversia lor în reguli Schematron . Odată ce aceste reguli Schematron sunt adăugate în proiectul DITA XML și încep să afișeze erori în conținutul editat, acțiunea AI inclusă Fix Validation Problems poate fi folosită pentru a solicita AI-ului să corecteze problemele raportate în documentul curent. Dacă motorul AI încearcă să salveze conținut într-un topic și conținutul salvat are probleme de validare, AI-ul primește problemele de validare și încearcă să le corecteze automat până când topicul devine valid.

source: An alternative to defining a style guide in the AI context prompt or to impose them after the content is generated would be to create a fine-tuned AI model trained with small examples based on the internal style guide and created also using an AI model.
ro: O alternativă la definirea unui ghid de stil în contextul prompt AI sau la impunerea regulilor după generarea conținutului ar fi crearea unui model AI antrenat special, cu exemple mici bazate pe ghidul de stil intern și create tot cu ajutorul unui model AI.

source: DITA XML DTD/Schemas Specialization
ro: Specializarea DTD/Scheme DITA XML

source: Quite often, a company that uses the DITA XML standard may decide to create a DTD or RelaxNG based specialization that defines new XML elements that are not known by the AI engine.
ro: Adesea, o companie care folosește standardul DITA XML poate decide să creeze o specializare bazată pe DTD sau RelaxNG care definește elemente XML noi, necunoscute motorului AI.

source: Most bundled AI actions attempt to preserve the existing XML structure, as much as possible. AI actions like Expand Draft start from a newly created DITA XML topic and thus preserves the existing DTD/schema reference and XML elements.
ro: Majoritatea acțiunilor AI incluse încearcă să păstreze cât mai mult structura XML existentă. Acțiuni precum Expand Draft pornesc de la un topic DITA XML nou creat și astfel păstrează referința DTD/schema și elementele XML existente.

source: Actions like Generate Documentation Draft can specify (in their definition) that a certain XML structure must be generated. An example, for this can be found here .
ro: Acțiuni precum Generate Documentation Draft pot specifica (în definiția lor) că trebuie generată o anumită structură XML. Un exemplu pentru aceasta poate fi găsit aici .

source: The most important XML vocabulary changes (DTD/schema references, newly added XML elements) can be distilled and set in the Context prompt text area within the AI Positron Assistant preferences page.
ro: Cele mai importante modificări de vocabular XML (referințe DTD/schema, elemente XML nou adăugate) pot fi sintetizate și setate în zona de text Context prompt din pagina de preferințe AI Positron Assistant .

source: Example of vocabulary changes described in the prompt context:
ro: Exemplu de modificări de vocabular descrise în contextul prompt:

source: # Vocabulary Changes DITA XML topics generated for our project's user's manual have the following structure and DOCTYPE declaration: ``` <!DOCTYPE oxyTopic PUBLIC "OXY-PUB-TOPIC" "oxy-system"> <oxyTopic> <title></title> <body> </body> </oxyTopic> ``` DITA XML concepts generated for our project's user's manual have the following structure and DOCTYPE declaration: ``` <!DOCTYPE oxyConcept PUBLIC "OXY-PUB-CONCEPT" "oxy-system"> <oxyConcept> <title></title> <body> </body> </oxyConcept> ``` New DITA XML elements are defined in our specific DITA XML vocabulary as follows: There is a new <part-term> XML element which must be used to tag various car parts. There is a new <product> XML element which must be used to tag product names. Example: The <product>Hisense</product> <part-term>engine</part-term> is more efficient.
ro: # Modificări de vocabular Topicurile DITA XML generate pentru manualul de utilizare al proiectului nostru au următoarea structură și declarație DOCTYPE: ``` <!DOCTYPE oxyTopic PUBLIC "OXY-PUB-TOPIC" "oxy-system"> <oxyTopic> <title></title> <body> </body> </oxyTopic> ``` Conceptele DITA XML generate pentru manualul de utilizare al proiectului nostru au următoarea structură și declarație DOCTYPE: ``` <!DOCTYPE oxyConcept PUBLIC "OXY-PUB-CONCEPT" "oxy-system"> <oxyConcept> <title></title> <body> </body> </oxyConcept> ``` Elemente DITA XML noi sunt definite în vocabularul nostru DITA XML specific astfel: Există un nou element XML <part-term> care trebuie folosit pentru a marca diverse piese auto. Există un nou element XML <product> care trebuie folosit pentru a marca denumirile de produse. Exemplu: <product>Hisense</product> <part-term>engine</part-term> este mai eficient.

source: You need to invest time to adapt the AI Positron add-on to generate better content for your particular project and organization particularities.
ro: Este necesar să investiți timp pentru a adapta suplimentul AI Positron astfel încât să genereze conținut mai bun pentru particularitățile proiectului și organizației dumneavoastră.

source: By specifying your specific project particularities in a context prompt, content created and re-written by an AI engine can become much more precise and fit better with your existing ways of working. Some of your project's rules can be automated allowing you to also detect and fix such problems after the content is generated using the AI engine.
ro: Prin specificarea particularităților proiectului dumneavoastră într-un context prompt, conținutul creat și rescris de motorul AI poate deveni mult mai precis și mai bine adaptat modului dumneavoastră de lucru. Unele reguli ale proiectului pot fi automatizate, permițându-vă să detectați și să corectați astfel de probleme după generarea conținutului cu ajutorul AI.

source: An example of a detailed context prompt that contains an overview of the project and audience, terminology, style rules, described vocabulary changes can be found here .
ro: Un exemplu de context prompt detaliat, care conține o prezentare generală a proiectului și a publicului țintă, terminologie, reguli de stil, modificări de vocabular descrise, poate fi găsit aici .

source: Overcoming Challenges - Editing DITA XML content with AI Tools (Presentation)
ro: Depășirea provocărilor – Editarea conținutului DITA XML cu instrumente AI (Prezentare)

source: The DITA XML standard is recognized (for good reason) for its versatile reuse capabilities, which allows for creating content that is consistent and can be used to single-source the entire publication needs of a company.
ro: Standardul DITA XML este recunoscut (pe bună dreptate) pentru capacitățile sale versatile de reutilizare, care permit crearea de conținut coerent și utilizabil pentru a acoperi toate nevoile de publicare ale unei companii dintr-o singură sursă.

source: AI editing tools can bring lots of extra benefits for technical documentation writers, capabilities for re-writing content to improve readability, grammar checking, content generation, generating reports, and much more.
ro: Instrumentele de editare AI pot aduce numeroase beneficii suplimentare pentru redactorii de documentație tehnică, oferind capabilități de rescriere a conținutului pentru îmbunătățirea lizibilității, verificare gramaticală, generare de conținut, generare de rapoarte și multe altele.

source: How do these benefits interact with the DITA XML features (content reuse, specialization) and how can AI tools be developed to work better with these DITA XMl specific features?
ro: Cum interacționează aceste beneficii cu funcționalitățile DITA XML (reutilizarea conținutului, specializare) și cum pot fi dezvoltate instrumentele AI pentru a lucra mai bine cu aceste caracteristici specifice DITA XML?
